const questionList = [
  {
    question: "سىز نېمىدىن تەسەللىيگە ئېرىشىشنى خالايسىز؟",
    options: [
      {
        text: "باشقىلارنىڭ ھېسداشلىقىدىن",
        value: "E",
      },
      {
        text: "ئۆزۈمنىڭ ئىچكى تۇيغۇسىدىن",
        value: "I",
      },
    ],
  },
  {
    question: "ئىجدىمائىي ئالاقە سورۇنىدا، سىز ھەمىشە",
    options: [
      {
        text: "ئۆزىڭىزنى راھەت ھېس قىلىسىز، سورۇن تۈگىگىچە ئولتۇرىسىز",
        value: "E",
      },
      {
        text: "ئۆزىڭىزنى ھارغۇن ھېس قىلىسىز، بالدۇرراق ئۆيگە قايتقىڭىز كېلىدۇ",
        value: "I",
      },
    ],
  },
  {
    question: "ئارام كۈنلىرىدە، قايسىسىغا كۆڭلىڭىز تارتىدۇ؟",
    options: [
      {
        text: "ئادەملەر توپلاشقان قايناق جايلارغا بېرىپ ئويناش",
        value: "E",
      },
      {
        text: "ئىللىق ئۆيدە ئولتۇرۇپ، كىنو كۆرۈش ياكى غىزالىنىش",
        value: "I",
      },
    ],
  },
  {
    question: "ئۇچرىشىشقا بارغاندا، سىز ئادەتتە",
    options: [
      {
        text: "ئۆزىڭىزنى قويۇۋېتىپ، ئەركىن ھەم راھەت پاراڭلىشالايسىز",
        value: "E",
      },
      {
        text: "تىنچ ئولتۇرۇشنى خالايسىز، تاكى سىز ئۆزىڭىزنى راھەت ھېس قىلغانغا قەدەر",
        value: "I",
      },
    ],
  },
];


export default questionList;
