const questionList = [
  {
    question: "سىز نېمىدىن تەسەللىيگە ئېرىشىشنى خالايسىز؟",
    options: [
      {
        text: "باشقىلارنىڭ ھېسداشلىقىدىن",
        value: "E",
      },
      {
        text: "ئۆزۈمنىڭ ئىچكى تۇيغۇسىدىن",
        value: "I",
      },
    ],
  },
  {
    question: "ئىجدىمائىي ئالاقە سورۇنىدا، سىز ھەمىشە",
    options: [
      {
        text: "قانچە كەچ بولۇپ كېتىشىدىن قەتئىينەزەر، ئۆزىڭىز ياقتۇرسىڭىز، ئەڭ ئاخىرىغىچە ئولتۇرىسىز",
        value: "E",
      },
      {
        text: "كەچ بولا بولماي چارچاش ھېس قىلىسىز، ئۆيگە قايتقىڭىز كېلىدۇ",
        value: "I",
      },
    ],
  },
  {
    question: "تۆۋەندىكى قايسى ئىش سىزنى بەكراق جەلپ قىلىدۇ؟",
    options: [
      {
        text: "ئۆزۈم سۆيگەن كىشى بىلەن ئادەملەر توپلاشقان قايناق جايلارغا بېرىش",
        value: "E",
      },
      {
        text: "ئۆزۈم سۆيگەن كىشى بىلەن تىنچ ھەم ئىللىق ئۆيدە ئولتۇرۇپ، كىنو كۆرۈش ياكى بىللە غىزالىنىش",
        value: "I",
      },
    ],
  },
  {
    question: "ئۇچرىشىشقا بارغاندا، سىز ئادەتتە",
    options: [
      {
        text: "ئۆزىڭىزنى قويۇۋېتىپ ئەركىن راھەت پاراڭلىشالايسىز",
        value: "E",
      },
      {
        text: "تىنچ ئولتۇرۇشنى خالايسىز، تاكى سىز ئۆزىڭىزنى توللۇق راھەت ھېس قىلغانغا قەدەر",
        value: "I",
      },
    ],
  },
];


export default questionList;
