const questionList = [
  {
    question: "سىز قانداق قارار چىقىرىشقا ئامراق؟",
    options: [
      {
        text: "ئاۋۋال كۆڭۈلگە بېقىپ، ئاندىن لوگىكىغا",
        value: "F",
      },
      {
        text: "ئاۋۋال لوگىكىغا بېقىپ، ئاندىن كۆڭۈلگە",
        value: "T",
      },
    ],
  },
  {
    question: "سىز قايسى ئەھۋالغا بىرقەدەر سەزگۈر؟",
    options: [
      {
        text: "كىشىلەر روھىي جەھەتتىكى ياردەمگە ئېھتىياج بولغاندا",
        value: "F",
      },
      {
        text: "كىشىلەر لوگىكىدىن يىراقلاپ كەتكەندە",
        value: "T",
      },
    ],
  },
  {
    question: "بىرسى بىلەن ئايرىلىپ كەتكەندە",
    options: [
      {
        text: "سىز ئىشق دەردىدە ھەسرەت چېكىپ، زور مۇشەققەتتە ئاران بۇ قايغۇ-ئەلەمدىن قۇتۇلالايسىز",
        value: "F",
      },
      {
        text: "گەرچە كۆڭلىڭىز يېرىم بولسىمۇ، قارار چىقىرىپ بولغان بولسىڭىز، قارشى تەرەپتىن تېز يىراقلىشىسىز",
        value: "T",
      },
    ],
  },
  {
    question: "بىرسى بىلەن يۈرگەندە، قايسى جەھەتكە بەكراق ئەھمىيەت بېرىسىز؟",
    options: [
      {
        text: "ھېسسىيات جەھەتتىكى ماسلىشىشقا. ئۇنىڭغا كۆڭلىڭىزدىكىنى ئىپادىلەشتىن ئەيمىنىسىز.",
        value: "F",
      },
      {
        text: "ئەمەلىيەتچان ماسلىشىشقا. ئۇنىڭ بىلەن كەلگۈسىدىكى پىلان-خىياللىرىڭىزنى ئوچۇق پاراڭلىشالايسىز.",
        value: "T",
      },
    ],
  },
];

export default questionList;
