const questionList = [
  {
    question: "سىز قانداق قارار چىقىرىشقا ئامراق؟",
    options: [
      {
        text: "ئاۋۋال كۆڭۈلگە بېقىپ، ئاندىن لوگىكىغا",
        value: "F",
      },
      {
        text: "ئاۋۋال لوگىكىغا بېقىپ، ئاندىن كۆڭۈلگە",
        value: "T",
      },
    ],
  },
  {
    question: "سىز قايسىسىغا مايىل؟",
    options: [
      {
        text: "توغرا-خاتا بولىشىدىن قەتئىينەزەر، باشقىلارغا روھىي تەسەللىي بېرىشكە",
        value: "F",
      },
      {
        text: "ئىشنىڭ توغرا-خاتالىقىنى ئايرىپ، باشقىلارغا يول كۆرسىتىشكە",
        value: "T",
      },
    ],
  },
  {
    question: "بىرسى بىلەن ئايرىلىپ كەتسىڭىز",
    options: [
      {
        text: "ئىشق دەردىدە ھەسرەت چېكىپ، زور مۇشەققەتتە ئاران قايغۇ-ئەلەمدىن قۇتۇلالايسىز",
        value: "F",
      },
      {
        text: "گەرچە كۆڭلىڭىز يېرىم بولسىمۇ، قارار چىقىرىپ بولغان بولسىڭىز، قارشى تەرەپتىن يىراقلىشىسىز",
        value: "T",
      },
    ],
  },
  {
    question: "بىرسى بىلەن يۈرگەندە، قانداق ھېس-تۇيغۇدا بولىسىز؟",
    options: [
      {
        text: "قانداق بۇلار دەپ كۆپ ئويلاپ، كۆڭلىڭىزدىكىنى ئىپادىلەشتىن ئەيمىنىسىز",
        value: "F",
      },
      {
        text: "ئەركىن ھالەتتە كەلگۈسىدىكى پىلان-خىياللىرىڭىزنى ئوچۇق ئېيتالايسىز",
        value: "T",
      },
    ],
  },
];

export default questionList;
