const questionList = [
  {
    question:
      "ناۋادا سىزدە يېتەرلىك پۇل ۋە ۋاقىت بولسا، بىر دوستىڭىز كېلىپ ساياھەت قىلايلى دېسە، سىز",
    options: [
      {
        text: "كالېندار ۋە ھاۋارايىغا قاراپ، پىلان تۈزۈشكە باشلايسىز",
        value: "J",
      },
      {
        text: "يۈك تاقلىرىڭىزنى يىغىشتۇرۇپ، يولغا چىقىشقا ھازىرلىنىسىز",
        value: "P",
      },
    ],
  },
  {
    question: "تۇنجى قېتىملىق ئۇچرىشىشتا، قارشى تەرەپ كېچىكىپ قالسا",
    options: [
      {
        text: "غەزەپلىنىسىز. نېمە قىلغىنى بۇ دەپ",
        value: "J",
      },
      {
        text: "ھېچقىسى يوق. سىزمۇ پات-پات كېچىكىپ قالىسىز",
        value: "P",
      },
    ],
  },
  {
    question: "سىز قايسىسىغا مايىل",
    options: [
      {
        text: "ئىشلارنى ئاۋۋال پىلانلىۋېلىپ، شۇ بويىنچە ئىجرا قىلىشقا",
        value: "J",
      },
      {
        text: "كۆپ پىلان تۈزمەيلام، ئىشنىڭ ئۆز يولىغا بېقىشقا",
        value: "P",
      },
    ],
  },
  {
    question: "كۆپىنچە ئەھۋالدا",
    options: [
      {
        text: "سىز ئۈلگۈرۈپ كېلىسىز، باشقىلار كېچىكىپ قالىدۇ",
        value: "J",
      },
      {
        text: "باشقىلار ئۈلگۈرۈپ كېلىدۇ، سىز كېچىكىپ قالىىسىز",
        value: "P",
      },
    ],
  },
];

export default questionList;
