const questionList = [
  {
    question: "سىز قارار چىقارغاندا",
    options: [
      {
        text: "كەلگۈسىدە يۈز بېرىش مۇمكىنچىلىكىگە ياكى پەرەزگە ئاساسلىنىسىز",
        value: "N",
      },
      {
        text: "يۈز بېرىپ بولغان ئىشنىڭ جەريانىغا ۋە نەتىجىسىگە ئاساسلىنىسىز",
        value: "S",
      },
    ],
  },
  {
    question: "سىز قايسىسىغا مايىل؟",
    options: [
      {
        text: "بىۋاسىتە ھېس-تۇيغۇڭىزغا قاراپ ئىش تۇتۇشقا",
        value: "N",
      },
      {
        text: "تەجرىبىڭىز ۋە شارائىتىڭىزغا قاراپ ئىش تۇتۇشقا",
        value: "S",
      },
    ],
  },
  {
    question: "خىزمەت ياكى ئوقۇشتا، سىز قايسىسىنى خالايسىز؟",
    options: [
      {
        text: "داۋاملىق ئالغا سىلجىپ، يۈكسىلىپ تۇرۇشنى",
        value: "N",
      },
      {
        text: "چېكىنىپلام كەتمىسىڭىز، ھازىرقى ھالەتنى ساقلاشنى",
        value: "S",
      },
    ],
  },
  {
    question: "بىرسى بىلەن ھەمسۆھبەتتە بولغاندا",
    options: [
      {
        text: "خىيالىي ۋە فانتازىيەلىك نەرسىلەر ھەققىدە پاراڭلىشىشنى ياقتۇرىسىز",
        value: "N",
      },
      {
        text: "ئەمەلىي ۋە قوللىنىشچان نەرسىلەر ھەققىدە پاراڭلىشىشنى ياقتۇرىسىز",
        value: "S",
      },
    ],
  },
];

export default questionList;
