export default [
  {
    value: "ISTJ",
    name: "تەستىقچى",
    content: "تەمكىن، ئەستايىدىل. ئىشلارنى ئەتراپلىق ۋە ئىشەنچىلىك ئۇسۇلدا قىلىدۇ. ئەمەلىيەتچان، مەسئۇلىيەتچان. قارارنى لوگىكىلىق چىقىرىدۇ، ھەمدە قەدەممۇ-قەدەم نىشانىغا قاراپ تىرىشىدۇ، ئاسان دىققىتى چېچىلمايدۇ. خىزمەت، ئائىلە ۋە تۇرمۇشنى ئەتراپلىق پىلانلاشنى ياخشى كۆرىدۇ. ئەنئەنىنى ۋە سادىقلىقنى چوڭ كۆرىدۇ.",
    jobs: "پىروگراممېر، ئاسترونوم، ساندان باشقۇرغۇچى، كاتىپ، ئۆي-مۈلۈك دېرىكتورى، مەمۇرىي باشقۇرۇش، مېتېئورولوگ، ساغلاملىق تېرنىرى، ئىقتىسادىي مۇپەتتىش، رازۋېدچىك",
    advantage: "سەمىمىي، مەسئۇلىيەتچان، تەمكىن، ئېغىر-بېسىق",
    disadvantage: "بەزىدە بەك قاتمال، جاھىللىق قىلىدۇ. خاتالىقنى ئۆزى ئۈستىگە ئېلىپ، ئۆزىنى ئەيىپلەپ سالىدۇ",
    friendship: "دوستلۇق جەھەتتە، ISTJ تىپىدىكىلەر سادىق، ئىشەنچىلىك كېلىدۇ. باشقىلار بەلكىم تۇرمۇش ھەلەكچىلىكىدە بىر-بىرىدىن يىراقلاپ كېتىشى مۇمكىن، ئەمما ISTJ تىپىدىكىلەر دوستىدىن ئاسانلىقچە يىراقلاشمايدۇ. مۇھەببەت جەھەتتە، ISTJ تىپىدىكىلەر باشتىن ئاخىر سادىق بولالايدۇ. ئۇلار ئاسانلىقچە مۇھەببەتنىڭ قاينىمىغا چۆكمەيدۇ، بەلكى ئاۋۋال چوڭقۇر ئويلىنىش قىلىپ، مەنپەئەت ۋە زىياننى دەڭسەپراق ئىش تۇتىدۇ."
  },
  {
    value: "ISFJ",
    name: "ھىمايىچى",
    content: "تەمكىن، دوستانە، مەسئۇلىيەتچان، ۋىجدانلىق. ئۆزىنىڭ مەجبۇرىيىتىنى ئادا قىلىشتا چىڭ تۇرىدۇ. ئەتراپلىق، تىرىشچان، ئىنچىكە، سادىق، كۆيۈمچان، ئەستايىدىل، باشقىلارنىڭ ھېسسىياتىغا كۆڭۈل بۆلىدۇ. رەتلىك ھەم ئىللىق ئائىلە مۇھىتى خىزمەت مۇھىتى بەرپا قىلىش ئۈچۈن تىرىشىدۇ.",
    jobs: "دوختۇر، ئوزۇقشۇناس، كۈتۈپخانا باشقۇرغۇچى، لايىھەچى، ئابونت مۇلازىمەتچىسى، بوغالتىر، ئوقۇتقۇچى، مېھمانخانا باشقۇرغۇچى، ئادۋوكات ياردەمچىسى، ئادەم ئىشلىرى باشقۇرغۇچى، ئۇستاز ياكى مەسلىھەتچى، سۇغۇرتا ۋاكالەتچىسى",
    advantage: "باشقىلارغا كۆڭۈل بۆلىدۇ، تىرىشچان، مەسئۇلىيەت تۇيغۇسى كۈچلۈك، ئىشەنچىلىك، سەۋىرچان، تەپەككۇر ۋە كۆزىتىشكە ماھىر، ئەمەلىيەتكە ئۇستا",
    disadvantage: "ئۆزىنى ئەيىبلەيدۇ. زىيادە كەمتەر ھەم تارتىنچاق. ئەندىشىلىرى كۆپ، ئۆزىنى چارچىتىپ قۇيىدۇ. باشقىلارنىڭ كۈتكىنىنى رازى قىلىشقا ئامراق",
    friendship: "دوستلۇق جەھەتتە، ISFJ تىپىدىكىلەر ئۆزىنى قوغداش ئۈچۈن تارتىنىدۇ. ئۇلار ھېسسىيات جەھەتتىكى چوڭقۇر باغلىنىشقا ئېھتىياج، شۇ سەۋەپ، ISFJ تىپىدىكىلەر كۆپىنچە تاساددىبىيلىقتىن تونۇشۇپ قېلىپ ئەمەس، بەلكى سىجىل راھەت ئالاقە قىلىپ تۇرغانلىقتىن دوست تۇتىدۇ. مۇھەببەت جەھەتتە، ISFJ تىپىدىكىلەر بولسا مۇلايىم ھەم سادىق جۆرىلەردىندۇر. ئۇلار نۇرغۇن ۋاقىت ۋە زېھىن سەرپ قىلىپ بۇ مۇناسىۋەتنى داۋاملاشتۇرىدۇ."
  },
  {
    value: "INFJ",
    name: "تەدبىرچى",
    content: "مەنتىق، مۇناسىۋەت، ماددىلار ئوتتۇرىسىدىكى باغلىنىشنى ۋە ئەھمىيىتىنى تەتقىق قىلىشقا ھېرىسمەن. باشقىلارنى ئىلھاملاندۇرۇشنى ياخشى كۆرىدۇ. ئادەملەرنى كۆزىتىشكە ماھىر. مەسئۇلىيەتچان، ئۆزىنىڭ قىممەت قارىشىدا چىڭ تۇرىدۇ. باشقىلارغا قانداق قىلىپ تېخىمۇ ياخشى مۇلازىمەت قىلىشنى بىلىدۇ ھەم شۇ نىشانى ئۈچۈن پىلانلىق ۋە كەسكىن تەدبىر كۆرىدۇ.",
    jobs: "قۇرۇلۇش لايىھەلىگۈچى، تەربىيەلىگۈچى، كەسپ مەسلىھەتچىسى، پىسخىكا مەسلىھەتچىسى، توربەت تەھرىرى، يازغۇچى، كېسىمچى، ئادەم كۈچى باشقۇرغۇچى، يېتەكچى، تىجارەتچى، تەرجىمان",
    advantage: "يېڭىلىق يارىتىشقا ماھىر، پىرىنسىپچان، ئەخلاق قارىشى كۈچلۈك، باشقىلاردىن پايدىلىنالايدۇ",
    disadvantage: "زىيادە سەزگۈر، ئىچىدىكىنى بەك ئېچىۋېتىشنى خالىمايدۇ، مۇكەممەللىكنى قوغلىشىدۇ",
    friendship: "دوستلۇق جەھەتتە، INFJ تىپىدىكىلەر تارتىنچاق ئەمەس، لېكىن ھەممە ئىشقا قوشۇق سېلىشتىن يىراق تۇرىدۇ. ئۇلار مۇلايىم، دوستانە كېلىدۇ، باشقىلار بىلەن چىقىشىپ ئۆتەلەيدۇ، لېكىن بەك يېقىن مۇناسىۋەتتە بولمايدۇ. بۇ تىپتىكىلەر ئۆزىنىڭ يېقىن بولغان تونۇشلار چەمبىرىكى بولىشىنى خالايدۇ. مۇھەببەت جەھەتتە، INFJ تىپىدىكىلەر جۆرە تاللاشقا بەك ئەھمىيەت بېرىدۇ. ئۇلار قىزغىن، چىن، ماسلاشقان بىرىنى قوغلىشىدۇ."
  },
  {
    value: "INTJ",
    name: "مۇتەخەسسىس",
    content: "ئۆزىنىڭ ئويلىرىنى ياكى نىشانىنى ئەمەلگە ئاشۇرۇش ئۈچۈن نۇرغۇن يېڭىلىقلارنى يارىتىدۇ ھەم ئىجرا قىلىدۇ. ناھايىتى تېزلا ئىشلارنىڭ ماھىيىتىنى ۋە قانۇنىيىتىنى ئىگەللىيەلەيدۇ ھەمدە ئۇزۇن مەزگىللىك تەدبىر تۈزەلەيدۇ. بىر ئىشنى قارار قىلىپ قالسا، شۇ ئىشنى پۈتكۈزگىچە تىرىشىدۇ. قىزىققاق، مۇستەققىل، ئۆزى ۋە باشقىلارغا يۇقىرى تەلەپ قويىدۇ.",
    jobs: "مالىيەچى، ئادۋوكات، لايىھە ئېنژىنىرى، روھىي ئانالىزچى، مۇتەخەسسىس، مېدىئا پىلانلىغۇچى، تور باشقۇرغۇچى، ئىقتىسادشۇناس، تىخنىكاشۇناس، مېدىدسىنا مۇتەخەسسىسى، كەشپىياتچى",
    advantage: "ئانالىز قىلىشقا ماھىر، ناھايىتى كۈچلۈك يېڭىلىق يارىتىش ئىقتىدارى ۋە لوگىكىلىق تەپەككۇرغا ئىگە، ئەمەلىيەتچان، ئۆزىنى تىزگىنلىيەلەيدۇ، مۇستەققىل، يىراقنى كۆرەر",
    disadvantage: "سوغوققان، تاقەتسىز، زىيادە ئانالىزغا بېرىلىدۇ، باشقىلارنىڭ ئېھتىياجىغا ئېتىبارسىز، ئۆزىگە زىيادە ئىشىنىدۇ",
    friendship: "دوستلۇق جەھەتتە، INTJ تىپىدىكىلەر ئۆز-ئارا چۈشىنىش ۋە ئورتاقلىق بولغان كىشىلەر بىلەن دوستلۇق مۇناسىۋەتتە بولۇشنى خالايدۇ. لېكىن ئۇلار دوست تۇتۇشتا قەتئىي ئاكتىپ ئەمەس. ئۇلار ئالاقە سورۇنىدا باشقىلارنىڭ دىققىتىنى قوزغاشنى خالىمايدۇ، ھەم باشقىلارغا ئاسانلىقچە ئىچىدىكىنى ئاشكارىلىمايدۇ. مۇھەببەت جەھەتتە، INTJ رومانتىك ئەمەستۇر. ئۇلار ھەممە ئىشنى ئىدراكىي پىلانلاپ، ھېسسىي جەھەتتىكى ئىشلارنى نەزەردىن ساقىت قىلىپ قويىدۇ."
  },
  {
    value: "ISTP",
    name: "سىنىغۇچى",
    content: "چاققان، تېتىك، چىدامچانلىقى كۈچلۈك، جىمجىت كۆزىتىشكە ماھىر، بىر ئىش سادىر بولغاندا، دەرھال ھەرىكەت قىلىدۇ، تەدبىر-چارە ئىزدەيدۇ. ئىشلارنىڭ ماھىيىتىنى ئانالىز قىلىپ، ناھايىتى تېزلا ئۇچۇرلاردىن پايدىلىنىپ نۇقتىلىق تەدبىرگە ئېرىشەلەيدۇ. سەۋەپ ۋە نەتىجىگە قىزىقىدۇ، لوگىكىلىق ئۇسۇلدا مەسىلىلەرنى ھەل قىلىدۇ، ئىش ئۈنۈمىگە ئەھمىيەت بېرىدۇ.",
    jobs: "ئۇچۇر مۇلازىمىتى، پىروگراممىر، ساقچى، يۇمشاق دېتال لايىھەلەش، ئادۋوكات، ئوت ئۆچۈرۈش ياكى قۇتقۇزۇش خىزمىتى، دورىگەر، تىجارەتچى، بانكىر، باشقۇرۇش مەسلىھەتچىسى، ھايۋان كۆندۈرگۈچى",
    advantage: "تەمكىن، ئاقىلانە، تەۋەككۈلچى، روھلۇق، ئۈمىدۋار",
    disadvantage: "زىيادە مۇستەققىل، ھېس-تۇيغۇدا مۇتەئەسسىپ، بىر ئاز سوغوققان، تەۋەككۈل قىلىشقا ھېرىسمەن",
    friendship: "دوستلۇق جەھەتتە، ISTP تىپىدىكىلەر تەۋەككۈل قىلىشقا ئامراق بولغاچ، بۇ تىپتىكىلەر بىلەن بىرگە بولغاندا زېرىكىشلىك بولمايدۇ. ISTP تىپىدىكىلەر كۆپىنچە ئاددىي ھەم بىۋاسىتە ئۇسۇلدا پاراڭلىشىشنى خالايدۇ، ھەمدە بىر-بىرسىنىڭ ئۆزىگە تەۋە شەخسىيىتىنى ھۆرمەت قىلىدۇ. مۇھەببەت جەھەتتە، ISTP تىپىدىكىلەرنى چۈشىنىش سەل قىيىنغا توختايدۇ. ئۇلار بىر ئىشنى قارار قىلسا، ئۇنىڭ ئۈچۈن ھەممە چارىلەرنى قوللىنىشقا تەييار تۇرىدۇ."
  },
  {
    value: "ISFP",
    name: "سەنئەتكار",
    content: "جىمغۇرراق، دوستانە، سەزگۈر، مۇلايىم. ھازىرقى مىنۇتلاردىن ھۇزۇر ئالىدۇ. ئۆزىنىڭ شەخسى بوشلۇقى بولىشىنى، ئۆزىنىڭ ۋاقىت جەدۋىلى بويىچە ئىش قىلىشنى ياخشى كۆرىدۇ. ئۆزىنىڭ قىممەت قارىشىغا ۋە ئۆزى مۇھىم دەپ بىلگەن كىشىلەرگە ناھايىتى سادىق كېلىدۇ. مۇنازىرىلىشىش ياكى توقۇنۇشۇپ قېلىشنى ياخشى كۆرمەيدۇ. ئۆزىنىڭ ئوي-پىكرى ياكى قىممەت قارىشىنى باشقىلارغا تاڭمايدۇ.",
    jobs: "ئابونىت مۇلازىمىتى، كىيىم-كېچەك لاھىيەلىگۈچى، ئاشپەز، سېسترا، چىش دوختۇرى، ساياھەت باشقۇرۇش، باغۋەنچىلىك، ئۆلچەش خادىمى، مەمۇر",
    advantage: "يېڭىلىق يارىتىش كۈچى مول، سەنئەتكە قىزىققاق، ھېس-تۇيغۇسىنى ئىپادىلەشكە ماھىر، جەلىپكار",
    disadvantage: "زىيادە سەزگۈر، مۇستەققىل، ھېسسىياتچان",
    friendship: "دوستلۇق جەھەتتە، ISFP تىپىدىكىلەر چوڭقۇر بولغان مۇناسىۋەت ئورنىتىشنى خالايدۇ. شۇڭا بۇ تىپتىكىلەر بىلەن بىرگە بولغاندا، كۆڭلى ھەر زامان توق بولىدۇ. ئەگەر دوستلىرى ئۇلارغا ئۈزلۈكسىز ئىشەنچ ۋە چۈشىنىش ئاتا قىلالىسا، ئۇلار دوستلىرىغا ھەسسىلەپ مېھىر ۋە ئىللىقلىق بىلەن جاۋاپ قايتۇرىدۇ. مۇھەببەت جەھەتتە، بۇ تىپتىكىلەر ناھايىتى رومانتىك كېلىدۇ، مۇھەببەتكە كۆڭۈل قۇيۇپ مۇئامىلە تۇتىدۇ. ISFP تىپىدىكىلەر بولسا رومانتىك ھەم كىشىنىڭ كۆڭلىنى چۈشىنىدىغان ياخشى ھەمراھلاردىندۇر. ئەگەر ئۇلار ئۆزىنىڭ ئاق ئاتلىق شاھزادىسى ياكى قار مەلىكىسىنى ئۇچراتسا، شۇنچىلىك بېرىلىپ تۇرۇپ سۆيىدۇ، پەرۋىش قىلىدۇ."
  },
  {
    value: "INFP",
    name: "ۋاسىتىچى",
    content: "ئىدىئالىزىمچى. ئۆزىنىڭ پىكرىدە چىڭ تۇرىدۇ، ئۆزى مۇھىم دەپ بىلگەن كىشىلەردىن ئاسانلىقچە يۈز ئۆرۈمەيدۇ. تاشقى دۇنيا بىلەن ئۆزىنىڭ ئىچكى دۇنياسىنىڭ بىردەك بولىشىنى ئارزۇ قىلىدۇ. ناھايىتى قىزىققاق، ئىشلارنىڭ يۈز بېرىش مۇمكىنچىلىكىنى تېزلا بىلەلەيدۇ، ئوي-خىياللارنى ئەمەلگە ئاشۇرۇشقا ۋاسىتىچى بولالايدۇ. باشقىلارنى چۈشىنىشنى ئويلايدۇ، ھەمدە باشقىلارنىڭ ئازۇسىنى ئەمەلگە ئاشۇرۇشىغا ياردەم بېرىدۇ. ماسلىشىشچانلىقى كۈچلۈك، ئۆزىنىڭ قىممەت قارىشىغا مۇخالىپ ئىشلار بولمىسىلا ھەر خىل مۇھىت ۋە ئەھۋاللارنى قۇبۇل قىلىپ كېتەلەيدۇ.",
    jobs: "پىسخولوگ، ئادەم كۈچى بايلىقى باشقۇرۇش، تەرجىمان، ئىجدىمائىي پەن پىروفېسسورى، ئىجدىمائىي خىزمەتچى، تەھرىر، كەسپ يېتەكچىسى، پاسون لاھىيەلىگۈچى، مەسلىھەتچى",
    advantage: "مېھرىبان، مەردانە، يېڭىلىق يارىتىشقا ماھىر، ئىدىيەسى ئوچۇق، ئىدىئالىزىمچى. ھېچقاچان بىراۋلارنى بىر ئىشقا مەجبۇرلىمايدۇ",
    disadvantage: "بەزەندە ئەمەلىيەتچان ئەمەس، دىققىتىنى مەركەزلەشتۈرەلمەيدۇ، ئۆزىنى بېكىنمە قىلىدۇ، ھېس-تۇيغۇ جەھەتتە ئاجىزراق",
    friendship: "دوستلۇق جەھەتتە، INFP تىپىدىكىلەر ئۈچۈن دوستلۇق ناھايىتى بىباھادۇر. ئۇلار «دوستنى مەيداندا سىنا» دېگەنگە ئىشىنىدۇ. يېقىنلىرى بىلەن گۈزەل مىنۇتلارنى بىرگە ئۆتكۈزۈشنى ياخشى كۆرىدۇ. مۇھەببەت جەھەتتە، INFP تىپىدىكىلەر بولسا رومانتىك ھەم مېھىرلىك كېلىدۇ. ئۇلار دائىم يۇقىرى غايىلەر بىلەن رومانتىك بولۇشقا تىرىشىدۇ. مۇھەببەت ئىشلىرىغا كۆڭلىنى بېرىپ، ئۆمۈرلۈك ھەمراھىنى ئىزلەيدۇ."
  },
  {
    value: "INTP",
    name: "بىلىمخۇمار",
    content: "ئۆزى قىزىقىپ قالغان ھەر قانداق ئىشنىڭ ماھىيىتىنى بىلىپ چىقمىغىچە بولدى قىلمايدۇ. نەزەرىيىۋىي ۋە ئابستراكىت نەرسىلەرگە قىزىقىدۇ. ئىجدىمائىي ئالاقىگە قارىغاندا، تەپەككۇر قىلىشقا تېخىمۇ ئامراق. تەمكىن، ئىچ-مىجەز، ماسلىشىشچانلىقى كۈچلۈك. ئۆزى قىزىقىدىغان ئىشقا دىققىتىنى يىغالايدۇ ھەمدە ئۇنىڭغا دائىر مەسىلىلەرنى ماھىرلىق بىلەن ھەل قىلالايدۇ. گۇمانىي نەزەردە قاراپ، ئانالىز قىلىشقا ئامراق.",
    jobs: "يۇمشاق دېتال ئېچىش، تەۋەككۈل مەبلەغ سېلىش، قانۇنىي كېسىمچى، ئىقتىساد ئانالىزچىسى، پىروفېسسور، مۇزىكانت، تور بەت لاھىيەلىگۈچى، قۇرۇلۇش ئېنژىنىر، مالىيە ئانالىزچىسى، ئىقتىسادشۇناس، ئىستراتىگىيىلىك پىلان تۈزگۈچى",
    advantage: "كاللىسى ئۆتكۈر، ئۆزگىچە پىكىرلىك، مۇستەققىل، تەۋەككۈلچان، مىجەزى تۇراقلىق، كۆزىتىش ۋە ئانالىزگە ماھىر",
    disadvantage: "نەزەرىيىۋىي بىلىملەرگە زىيادە تايىنىۋالىدۇ، باشقىلارنى ئاسانلا نەزەردىن ساقىت قىلىپ قويىدۇ، ئىجدىمائىي ئالاقىگە ماھىر ئەمەس",
    friendship: "دوستلۇق جەھەتتە، INTP تىپىدىكىلەرنىڭ دوستلىرى ئۇلارنىڭ قېشىغا بىرەر قىيىنچىلىق ياكى مەسىلە ئۈستىدە ياردەم سوراپ كەلگەندە، ئۇلار ناھايىتى رازىمەنلىك بىلەن ياردەم تەمىن ئېتىدۇ. لېكىن ھېسسىيات مەسىلىسىگە كەلگەندە، ئۇلار بىرئاز بىئاراملىق ھېس قىلىدۇ. مۇھەببەت جەھەتتە، INTP تىپىدىلىلەر ئىچ مىجەز بولغاچ، يالغۇز يۈرۈشنى ياخشى كۆرىدۇ، لېكىن بۇ ھەرگىز بىرسىنىڭ ھەمراھ بولىشىغا تەشنا ئەمەس دېگەنلىك ئەمەس."
  },
  {
    value: "ESTP",
    name: "تەۋەككۈلچى",
    content: "تېتىك، چىدامچان، ئەمەلىيەتچان، نەتىجىگە بەكراق ئەھمىيەت بېرىدۇ. نەزەرىيىۋىي ۋە ئابستراكىت چۈشەنچىلەرنى زېرىكىشلىك ھېس قىلىدۇ. ئاكتىپلىق بىلەن ھەرىكەت قىلىپ مەسىلىلەرنى ھەل قىلىشقا ئامراق. ھازىرنىڭ ئۆزىگە ئەھمىيەت بېرىدۇ، ياسالمىلىق قىلمايدۇ، باشقىلار بىلەن بىللە بولغان مىنۇتلاردىن ھۇزۇر ئالىدۇ. ماددىي نەرسىلەردىن ھۇزۇر ئېلىشقا ۋە زامانىۋىيلىققا ئامراق. ئۆگىنىشنىڭ ئەك ياخشى ئۇسۇلى ئۆزىنىڭ بېشىدىن ئۆتكۈزۈش دەپ ئويلايدۇ.",
    jobs: "كارخانىچى، سۇغۇرتىچى، قۇرۇلۇش ئېنژىنىرى، ساياھەت باشقۇرۇش، كەسپىي تېرنىر ياكى تەنھەرىكەتچى، ئويۇن ئاچقۇچى، ئۆي-مۈلۈك ئاچقۇچى، ساتقۇچى، ئاكسىيە ۋاسىتىچىسى، باشقۇرۇش مەسلىھەتچىسى، ئوت ئۆچۈرگۈچى، ساقچى",
    advantage: "يۈرەكلىك، باتۇر، بىۋاسىتە، تەۋەككۈلچان، ئالاقىگە ماھىر، كۆزىتىش ئىقتىدارى ۋە باشقۇرۇش ئىقتىدارى كۈچلۈك، يېڭىلىق يارىتىشقا ئامراق",
    disadvantage: "ئاسان تاقەتسىزلىنىدۇ، قائىدە-تۈزۈملەرگە ئانچە پىسەنت قىلمايدۇ، تەۋەككۈل قىلىپ سىناپ بېقىشقا ئامراق",
    friendship: "دوستلۇق جەھەتتە، ESTP تىپىدىكىلەر ئىنتايىن چىقىشقاق بولۇپ، دوستلىرى ۋە تونۇشلىرى ئىنتايىن كۆپ كېلىدۇ. ئۇلارنىڭ جەلىپكارلىقى كۈچلۈك بولۇپ، دوستلىرىنى يېڭى ئىشلارنى سىناپ بېقىشقا ئۈندەيدۇ، تەۋەككۈل قىلىپ بېقىشقا ھەر ۋاقىت تەييار تۇرىدۇ. سىز بۇ تۈردىكىلەرنى خالىغان ۋاقىتتا توۋلاپ ئاچىقالايسىز. مۇھەببەت جەھەتتە، بۇ تۈردىكىلەر ئۆزىنىڭ قايناق ھېسسىياتىنى مۇھەببەتلىك تۇرمۇشقا سىڭدۈرۈپ ئەكىرىدۇ. تۇرمۇشنى قىزىقارلىق، مەنىلىك، خوشاللىققا چۆمدۈرىدۇ."
  },
  {
    value: "ESFP",
    name: "ماھارەتچى",
    content: "تاش مىجەز، چىقىشقاق، دوستانە، ھەر ئىشلارنى قوبۇل قىلىپ كېتەلەيدۇ. تۇرمۇشنى سۆيىدۇ، كىشىلەردىن ۋە تۇرمۇشتىن ھۇزۇر ئالىدۇ. باشقىلار بىلەن بىرلىكتە بىر ئىشنى تاماملاپ چىقىشنى ياخشى كۆرىدۇ. خىزمەتتە، ئەمەلىيەتچان ھەم قوللىنىشچان بولۇپ، خىزمەتنى مەنا قوشىدۇ. ياسالمىلىق قىلمايدۇ، يېڭى شەيئىلەرگە تېزلا ماسلىشىپ كېتەلەيدۇ. ئۆگىنىشنىڭ ئەڭ ياخشى ئۇسۇلىباشقىلار بىلەن بىرلىكتە سىناپ بېقىش دەپ ئويلايدۇ.",
    jobs: "يەسلىي ئوقۇتقۇچىسى، پائالىيەت پىلانلىغۇچى، ساياھەت يېتەكچىسى، ساتچۇچى، ئاكتىيور، چىش دوختۇرى، مال دوختۇرى، ئۇستاز-مۇئەللىم، مەبلەغ سالغۇچى",
    advantage: "يۈرەكلىك، ئۈمىدۋار، شوخ-تېتىك، ئىجدىمائىي ئالاقىگە ماھىر، ئېستىتىك تۇيغۇچى كۈچلۈك",
    disadvantage: "ئاسان دىققىتى چېچىلىدۇ، ھېسسىياتچان، پىلان تۈزۈشنى ياقتۇرمايدۇ",
    friendship: "دوستلۇق جەھەتتە، ESFP تىپىدىكىلەر ھەر خىل كىشىلەر بىلەن دوست بولۇشنى خالايدۇ، ئىجدىمائىي ئالاقىدىن ھۇزۇر ئالىدۇ، دوستلىرى بىلەن تۈرلۈك پائالىيەتلەرگە قاتنىشىشنى ياخشى كۆرىدۇ. ئۇلار ھېچ ئىشنى كۆڭلىدە ساقلاپ ياتمايدۇ، بەلكى ئاقىلانە، قىزىقارلىق، قىزغىن ۋە ئۈمىدۋارلىق بىلەن دوستلىرىغا ھەمبەھىرلەيدۇ. مۇھەببەت جەھەتتە، ESFP تىپىدىكىلەر ئۆزىنىڭ ھېس-تۇيغۇسىنى ئىپادىلەشنى ياخشى كۆرىدۇ. ھەر بىر مىنۇتلاردىن خوشاللىق ئىزدەپ، ھاياجان ۋە ئۆزگىرىشكە تولغان مۇناسىۋەتنى خالايدۇ. ESFP تىپىدىكىلەر ئاكتىپلىق بىلەن ئىناق، قىزغىن، مەنىلىك بولغان ئائىلە مۇھىتى قۇرۇپ چىقىشقا تىرىشىدۇ. ئۇلار ئائىلىسىدىن ھۇزۇر ئالىدۇ ھەمدە ئائىلىسىنى ئەڭ يۇقىرى ئورۇنغا قويىدۇ."
  },
  {
    value: "ENFP",
    name: "ئىجادىيەتچى",
    content: "ناھايىتى قىزغىن، تەسەۋۋۇر كۈچى تولۇپ تاشقان. ھاياتنىڭ تۈرلۈك مۇمكىنچىلىكى بار دەپ ئويلايدۇ. ئىنتايىن تېزلا ئىشلارنى ئۇچۇرلار بىلەن باغلاپ، ئۆزىنىڭ پەرىزىگە ئاساسەن ئىشەنچ بىلەن مەسىلىلەرنى ھەل قىلىپ كېتەلەيدۇ. ھەمىشە باشقىلارنىڭ ئېتىراپ قىلىشىغا ئېرىشىشنى ئىستەيدۇ ھەمدە باشقىلارغا قوللاش ۋە ياردەم بېرىشنى خالايدۇ. زېرەك، ياسالما ئەمەس، تەييارلىقسىزلا ئۆزىنىڭ ئىقتىدارىنى جارى قىلدۇرالايدۇ، نۇتۇق قابىلىيىتى كۆرۈرنەرلىك.",
    jobs: "ئېلان مۇلازىمەتچىلىكى، باشقۇرۇش مەسلىھەتچىسى، ئاكتىيور، تەكشىلىك لايىھەلىگۈچى، سەنئەت يېتەكچىسى، كارخانا خادىمى تەربىيلىگۈچى، پىسخولوگ، ئادەم كۈچى باشقۇرۇش، ناتىق، ئىگىلىك تىكلەش يېتەكچىسى، پىروگرامما پىلانلىغۇچى، رېژىسسور",
    advantage: "يېڭىلىق يارىتىشقا ماھىر، ئۈمىدۋار، قىزغىن، باشقىلارنى ئىلھاملاندۇرالايدۇ",
    disadvantage: "بەلكىم زىيادە ئىدىئالىزىمچىدۇر، ئاسان دىققىتى چېچىلاردۇر، باشقىلارغا خوشامەت قىلاردۇر",
    friendship: "دوستلۇق جەھەتتە، ENFP تىپىدىكىلەر ئىجدىمائىي ئالاقىگە ئامراق، شۇڭا ئۇلارنى زېرىكىشلىك ھېس قىلمايسىز. ئۇلار تەبىئىيلا ناتۇنۇش كىشىلەر بىلەن ئاداش بولۇپ كېتەلەيدۇ، پاراڭلىشىش مۇھىتىنى قىزغىنلاشتۇرالايدۇ. مۇھەببەت جەھەتتە، ئۇلار رومانتىك ھەم قىزغىن كېلىدۇ، ھەقىقىي ۋە چوڭقۇر مۇناسىۋەت ئورنىتىشنى خالايدۇ. ئۆزىنىڭ ھەمراھى بىلەن بىرلىكتە يېڭى ئىشلارنى سىناپ بېقىشنى خالايدۇ، بىرلىكتە ئورتاق بولغان نىشانلىرى ئۈچۈن تىرىشىدۇ، تۇرمۇشتىكى تەجرىبىلىرىنى مۇكەممەللەشتۈرىدۇ."
  },
  {
    value: "ENTP",
    name: "مۇنازىرىچى",
    content: "ئىنكاسى تېز، ئەقىللىق، زېرەك، باشقىلارنى ئىلھاملاندۇرالايدۇ، سەزگۈرلىكى يۇقىرى. يېڭى ھەم رىقابەتلىك مەسىلىلەرگە كەلگەندە چېۋەرلىك بىلەن ھەل قىلالايدۇ. نەزەرىيىۋىي مۇمكىنچىلىكلەرنى قېزىپ چىقىپ، يىراقنى كۆرگەن ئاساستا تەھلىل قىلالايدۇ. باشقىلارنى چۈشىنىشكە ماھىر. ئىشلارنى تەكرارلاۋېرىشقا ئۆچ، ئوخشىمىغان ئۇسۇللار ئارقىلىق ھەل قىلىشقا، يېڭى قىزىقىشلارنى يېتىلدۈرۈشكە ئامراق.",
    jobs: "كارخانىچى، مەبلەغ سالغۇچى، ئېلان يېڭىلىق ياراتقۇچى، بازار باشقۇرۇش مەسلىھەتچىسى، رىياسەتچى، ئاكتىيور، مەكتەپ مۇدىرى، كەشپىياتچى، مۇنازىرىلەشكۈچى، سۆھبەتچى",
    advantage: "بىلىمى مول، ئىدىيەسى ئۆتكۈر، ئالاقە ۋە ئىپادىلەشكە ماھىر، ئىزدىنىش روھى كۈچلۈك، قىزىقىشى مول، بىرلا ۋاقىتتا تۈرلۈك مەسىلىلەرنى ھەل قىلالايدۇ، يېڭى مۇھىتقا تېزلا ماسلىشالايدۇ",
    disadvantage: "ئۆزىگە زىيادە ئىشىنىدۇ، ئىنچىكە نۇقتىلارغا تاقەتسىز، بىر ئىشلاردىن ئاسانلىقچە زېرىكىدۇ",
    friendship: "دوستلۇق جەھەتتە، ENTP تىپىدىكىلەر مىجەزى ئوچۇق، روھى ئەركىن كېلىدۇ. ئۇلار بىلەن ھەمسۆھبەتتە بولغاندا، خوشاللىق ھېس قىلغىلى بولىدۇ. جەلىپكارلىقى ئىنتايىن كۈچلۈك. مۇھەببەت جەھەتتە، بۇ تۈردىكىلەر ئۆزىنى تېخىمۇ ئىلگىرلەشكە موھتاج دەپ بىلىدۇ. ھەمراھى بىلەن بىرلىكتە يېڭى ئىشلارنى سىناپ كۆرۈپ، ئۆزىنىڭ ھېسسىيات جەھەتتىكى يېتەرسىزلىكىنى تولۇقلايدۇ."
  },
  {
    value: "ESTJ",
    name: "رەھبەر",
    content: "ئەمەلىيەتچان، كەسكىن، قارار چىقارغان ھامان دەرھال ھەرىكەت قوللىنىدۇ. تۈرلەرنى ۋە ئادەملەرنى تەشكىللەپ، ئىشنى پۈتكۈزۈپ، ئەڭ ئۈنۈملۈك ئۇسۇل بىلەن نەتىجىگە ئېرىشىش ئۈچۈن تىرىشىدۇ. كۈندىلىك ئىنچىكە نۇقتىلارغا ئېتىبار بېرىدۇ. ئۆزىنىڭ ناھايىتى ئېنىق لوگىكا ئۆلچىمى بار، ئۆزى قەرەللىك ھالدا ئىجرا قىلىدۇ ھەمدە باشقىلارنىڭمۇ ئىجرا قىلىشىنى ئۈمىد قىلىدۇ. پىلان ئىجرا قىلغاندا كۈچلۈك ھەم تەدبىرلىك.",
    jobs: "شىركەت باش ئىجرائىلىيە ئەمەلدارى، ئوفېسسېر، دورىگەر، ئۆي-مۈلۈك ۋاسىتىچى، سوغۇرتا ۋاسىتىچى، ئوقۇتقۇچى، ئۆي-مۈلۈك باشقۇرغۇچى، تۈر دېرىكتورى، باشلىق، مۇدىر، رەھبەر",
    advantage: "مەسئۇلىيەت تۇيغۇسى كۈچلۈك، باشقۇرۇشقا ماھىر، ئۆزى ئۈلگە تىكلەپ، بوشاشماي تىرىشىدۇ، ھۇرۇنلۇق ۋە كۆچۈرمىچىلىككە قارشى تۇرىدۇ",
    disadvantage: "جاھىل، ئ‍ۆزۈمچى، قاتمالراق كېلىدۇ. ئۆزىنىڭ ئويلىغىنىدەك بولمىغان ئىشلارنى بىرمۇ-بىر كۆرسىتىپ بېرىدۇ",
    friendship: "دوستلۇق جەھەتتە، ESTJ تىپىدىكىلەر سادىق كېلىدۇ، ئادەمگەرچىلىكنى قەدىرلەيدۇ. ئۇلار ئىجدىمائىي ئالاقىنى ياخشى كۆرىدۇ. مۇھەببەت جەھەتتە، ئۇلار قىزغىن كېلىدۇ. ئۇلار بىلەن بىللە بولغاندا، مۇقىم ھەم مەنىلىك تۇرمۇشقا ئېرىشكىلى بولىدۇ. بىرسىنىڭ ھالىدىن خەۋەر ئېلىشنى قارار قىلغان بولسا، مەردلىك قىلىدۇ، قىزغىن بولىدۇ، تۈزۈت قىلمايدۇ، كۆيۈمچان بولىدۇ."
  },
  {
    value: "ESFJ",
    name: "پىداكار",
    content: "قىزغىن، مەسئۇلىيەت تۇيغۇسى كۈچلۈك. ئەتراپىدىكى مۇھىتنىڭ ئىللىق ھەم ئىجىل بولىشىنى خالايدۇ ھەم بۇنىڭ ئۈچۈن كۈچ چىقىرىدۇ. باشقىلار بىلەن بىرلىكتە بىر ئىشنى ئىنچىكىلىك بىلەن ۋاقتىدا تاماملاشنى ياقتۇرىدۇ. باشقىلارنىڭ نېمىگە ئېھتىياج ئىكەنلىكىنى ھېس قىلالايدۇ ھەمدە پۈتۈن كۈچى بىلەن ياردەم قىلىدۇ. باشقىلارنىڭ ئېتىراپ قىلىشىغا ئېرىشىشنى ئىستەيدۇ.",
    jobs: "ئ‍ۆي-مۈلۈك ۋاسىتىچى، پارچە ساتقۇچى، سېسترا، مال زاكازچى، تەنھەرىكەت تېرنىرى، يېمەك-ئىچمەك باشقۇرۇش، ساياھەت باشقۇرۇش، مال دوختۇرى، ئائىلە پەرۋىشكارى، ئادەم كۈچى مەسلىھەتچىسى، كاتىپ",
    advantage: "ئىجدىمائىي ئىقتىدارى ۋە مەسئۇلىيەت تۇيغۇچى كۈچلۈك، مۇلايىم، غەمخور",
    disadvantage: "ئۆزىنىڭ راھەت بەلۋېغىدىن ئاسانلىقچە چىقىپ كېتىشنى ياقتۇرمايدۇ، جەمئىيەتتىكى ئورنىدىن ۋە تەسىر كۈچىدىن زىيادە تەشۋىشلىنىدۇ",
    friendship: "دوستلۇق جەھەتتە، ESFJ تىپىدىكىلەرنىڭ دوستى كۆپ بولىدۇ، ئۇلار ئۆزىنىڭ ۋاقتى ۋە زېھنىنى چىقىرىپ بۇ مۇناسىۋەتلەرنى ساقلاشقا ئەھمىيەت بېرىدۇ. دوستلىرىنىڭ خوشال بولىشى ئۈچۈن كۈچ چىقىرىدۇ. مۇھەببەت جەھەتتە، ESFJ تىپىدىكىلەر ئۇچرىشىشتىن باشلاپ كەلگۈسىدىكى ئىشلارغىچە، ھەممىسىگە ناھايىتى ئەستايىدىل مۇئامىلە تۇتىدۇ. ئۇلار ھەمراھىنىڭ ئ‍ۆزىگە ئىنكاس قايتۇرۇپ تۇرىشىنى ئۈمىد قىلىدۇ، چۈنكى ئۇلار قارشى تەرەپنى خوشال قىلسامكەن دەپ ئويلايدۇ، مۇناسىۋەتنى تېخىمۇ مۇستەھكەم قىلسامكەن دەپ ئويلايدۇ."
  },
  {
    value: "ENFJ",
    name: "ئىلھاملاندۇرغۇچى",
    content: "قىزغىن، باشقىلارنى ئۈچۈن ئويلىيالايدۇ، مەسئۇلىيەتچان. باشقىلارنىڭ ھېسسىياتىغا، ئېھتىياجىغا، مەقسىتىگە ئەھمىيەت بېرىدۇ. باشقىلارنىڭ يوشۇرۇن كۈچىنى بايقىيالايدۇ ھەمدە ئۇلارغا ياردەم بېرىدۇ. بىر ئادەم ياكى بىر گۇرۇپپىنىڭ يۈكسىلىپ ئالغا ئىلگىرلىشىگە تۈرتكە بولالايدۇ. سادىق، ماختاش ۋە تەنقىدلەرگە ئاكتىپلىق بىلەن ئىنكاس قايتۇرىدۇ. دوستانە، پائالىيەتچان. باشقىلارنى يېتەكلەپ، ئىلھاملاندۇرالايدۇ.",
    jobs: "ئېلان ئابونىت باشقۇرۇش، ژورنال تەھرىرى، كارخانا خادىم تەربىيلىگۈچى، فىلىم ئىشلىگۈچى، ئوپېراتور، بازار ئاچقۇچى، يازغۇچى، ئىجدىمائىي خادىم، ئادەم كۈچى بايلىقى باشقۇرۇش، كېلىنكا دوختۇرى، كەسپ پىلانلىغۇچى، پروفېسسور، سېتىش لىدىرى، ئۇچۇر تېخنىكىچى، مۇخبىر",
    advantage: "ئىشەنچىلىك، قىزغىن، جەلىپكار، ماسلىشىشچان، ئوچۇق مىجەز",
    disadvantage: "زىيادە ئىدىئالىزىمچى، ئەمەلىيەتتىن يىراقلاپ قالىدۇ",
    friendship: "دوستلۇق جەھەتتە، ENFJ تىپىدىكىلەر ئۈچۈن ئىشەنچ ئەڭ مۇھىم بىر ئامىلدۇر. ئەگەر ئۇلار دوستلىرىنىڭ سەمىمىيەتسىزلىكىنى سېزىپ قالسا، بۇ دوستلۇق مۇناسىۋىتىدىن گۇمانلىنىدۇ. بۇ تىپتىكىلەر ئادەتتە ئۆزى بىلەن ئورتاق قىزىقىشى ياكى نىشانى بولغان كىشىلەر بىلەن دوست بولۇشنى خالايدۇ. مۇھەببەت جەھەتتە، ENFJ تىپىدىكىلەر بىرسىگە كۆيۈپ قالسا، ھەر بىر كىچىك نۇقتىلارغا ئەستايىدىللىق بىلەن مۇئامىلە قىلىدۇ، ئاكتىپ ھەم تاقەتچان كېلىدۇ. شۇ سەۋەپ، بۇ تىپتىكىلەر كۆپىنچە ئىشىق ئوتىدا دەرتمەن بولۇپ قالىدۇ."
  },
  {
    value: "ENTJ",
    name: "قوماندان",
    content: "سەمىمىي، كەسكىن، باشقۇرۇش ۋە يېتەكلەش ئىقتىدارى كۈچلۈك. ناھايىتى تېزلا شىركەت ياكى تەشكىلدىكى يېتەرسىزلىكلەرنى بايقاپ چىقىپ، ئۈنۈملۈك ۋە سېستىمىلىق ئۇسۇلدا مەسىلىلەرنى ھەل قىلالايدۇ. ئۇزۇن مەزگىللىك پىلان ۋە نىشانلارنى تۈزۈشكە ماھىر. كۆپنى كۆرگەن، ئۇقۇمۇشلۇق كېلىدۇ، ئۆزىنىڭ بىلىم دائىرىسىنى كېڭەيتىپ، باشقىلار بىلەن ھەمبەھرلەشنى ياخشى كۆرىدۇ. ئۆزىنىڭ ئوي-پىكرىنى ئوتتۇرىغا قويغاندا ناھايىتى جۇشقۇن كېلىدۇ.",
    jobs: "شىركەت باش ئىجرائىلىيە ئەمەلدارى، باشقۇرۇش مەسلىھەتچىسى، سىياسىيون، ئۆي-مۈلۈك ئاچقۇچى، مائارىپ مەسلىھەتچىسى، مەبلەغ سېلىش مەسلىھەتچىسى، سوتچى، تور مۇتەخەسسىسى، پۇل-مالىيە مەسلىھەتچىسى، ئادۋوكات، ئىقتىساد ئانالىزچىسى",
    advantage: "ئىش قىلىش ئۈنۈمى يۇقىرى، روھىي كۆتۈرەڭگۈ، ئۆزىگە ئىشىنىدۇ، ئىرادىسى كۈچلۈك، جەلىپكار. ئاكتىپ ئېنىرگىيە خالتىسى دېيىشكە بولىدۇ",
    disadvantage: "بەك كەسكىن كۆرۈنىدۇ، ھېسسىيات جەھەتتىكى مەسىلىلەرگە ئاجىز، مۇكەممەللىكنى قوغلىشىدۇ، بۇ تۈردىكى قىسمەن كىشىلەر جاھىل ھەم تاقەتسىز كېلىدۇ",
    friendship: "دوستلۇق جەھەتتە، ENTJ تىپىدىكىلەر مەسىلە ھەل قىلىشقا ئامراق بولغاچ، ئۇلاردىن ياردەم ۋە مەسلىھەت سوراشقا بولىدۇ. ئۇلار ئۆزلىرى بىلەن چوڭقۇر ھەم ئەھمىيەتلىك پىكىرلىشەلەيدىغان كىشىلەرنى ياخشى كۆرىدۇ. ئۇلار بەزەندە نە باشقىلارنىڭ ھېسسىيات جەھەتتىكى قوللىشىغا نە باشقىلارنىڭ ئېھتىياجىغا ئەھمىيەت بەرمەيدۇ، بۇ ئۇلارنىڭ بىر ئاجىز نۇقتىسىدۇر. مۇھەببەت جەھەتتە، ENTJ تىپىدىكىلەر بىر تۈرلۈك پىلان ۋە نىشانلار بىلەن مۇناسىۋەتنى داۋام ئەتمەكچى بولىدۇ. ئۇلار ھەمىشە باش قەھرىمان بولۇشنى خالايدۇ. ENTJ تىپىدىكىلەر ئۈچۈن ئەڭ ياخشى جۆرە: سادىق، زېرەك، مۇلايىم، ئۆزىنىڭ جاھاننى سورىشىغا ھەمدەمدە بولالايدىغان كىشىلەردۇر."
  }
];
