const questionList = [
  {
    question:
      "ناۋادا سىزدە يېتەرلىك پۇل ۋە ۋاقىت بولسا، بىر دوستىڭىز سىزگە يىراق يىراقلارغا بېرىپ ساياھەت قىلىپ كېلەيلى دېسە، سىز",
    options: [
      {
        text: "كالېندار ۋە ھاۋارايىغا قاراپ، پىلان تۈزۈشكە باشلايسىز",
        value: "J",
      },
      {
        text: "يۈك تاقلىرىڭىزنى يىغىشتۇرۇپ، «ھۇررا» دەپ يولغا چىقىشقا ھازىرلىنىسىز",
        value: "P",
      },
    ],
  },
  {
    question: "تۇنجى قېتىملىق ئۇچرىشىشتا، قارشى تەرەپ كېچىكىپ قالسا",
    options: [
      {
        text: "غەزەپلىنىسىز. نېمە قىلغىنى بۇ دەپ",
        value: "J",
      },
      {
        text: "ھېچقىسى يوق. سىزمۇ پات-پات كېچىكىپ قالىسىز",
        value: "P",
      },
    ],
  },
  {
    question: "سىز قايسىسىغا مايىل",
    options: [
      {
        text: "ئىشنى ئاۋۋال پىلانلىۋېلىشقا. نەگە، قانداق، قاچان دېگەندەك",
        value: "J",
      },
      {
        text: "كۆپ پىلان تۈزمەيلام، ئىشنىڭ ئۆز يولىغا بېقىشقا",
        value: "P",
      },
    ],
  },
  {
    question: "ئادەتتە",
    options: [
      {
        text: "سىز دەل ۋاقتىدا كېلىسىز، باشقىلار كېچىكىپ قالىدۇ",
        value: "J",
      },
      {
        text: "باشقىلار دەل ۋاقتىدا كېلىدۇ، سىز كېچىكىپ قالىىسىز",
        value: "P",
      },
    ],
  },
];

export default questionList;
