const questionList = [
  {
    question: "سىز قارار چىقارغاندا",
    options: [
      {
        text: "كەلگۈسىدە يۈز بېرىش مۇمكىنچىلىكىگە ياكى پەرەزگە ئاساسلىنىسىز",
        value: "N",
      },
      {
        text: "يۈز بېرىپ بولغان ئىشنىڭ جەريانىغا ۋە نەتىجىسىگە ئاساسلىنىسىز",
        value: "S",
      },
    ],
  },
  {
    question: "سىز قايسىسىغا مايىل؟",
    options: [
      {
        text: "بىۋاسىتە ھېس تۇيغۇڭىزغا قاراپ ئىش تۇتۇشقا",
        value: "N",
      },
      {
        text: "سىزنىڭ تەجرىبىڭىز ۋە ھازىرقى شارائىتىڭىزغا قاراپ ئىش تۇتۇشقا",
        value: "S",
      },
    ],
  },
  {
    question: "بىر مۇناسىۋەتتە، سىز",
    options: [
      {
        text: "داۋاملىق ئالغا ئىلگىرىلىسەك دەپ ئويلايسىز",
        value: "N",
      },
      {
        text: "بىرەر كۆڭۈلسىزلىك يۈز بېرىپ قالمىسىلام، ھازىرقى ھالەتنى ساقلىساق دەپ ئويلايسىز",
        value: "S",
      },
    ],
  },
  {
    question: "بىرسى بىلەن تونۇشقاندا",
    options: [
      {
        text: "كەلگۈسى توغرۇلۇق پاراڭلىشىشنى ياقتۇرىسىز. خىيالىي، فانتازىيەلىك نەرسىلەر ھەققىدە پاراڭلىشىسىز",
        value: "N",
      },
      {
        text: "ھازىرقى ئەمەلىي تۇرمۇشتىكى نەرسىلەر توغرۇلۇق پاراڭلىشىشنى ياقتۇرىسىز. ھەقىقىي، قوللىنىشچان نەرسىلەر ھەققىدە پاراڭلىشىسىز",
        value: "S",
      },
    ],
  },
];

export default questionList;
